Repository: Haplee/once
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: ca, es, eu

# appTitle
source: Change Calculator - ONCE App
ca: Calculadora de Canvi - ONCE App
es: Calculadora de Cambio - ONCE App
eu: Aldaketa Kalkulagailua - ONCE App

# historyPageTitle
source: Transaction History - ONCE App
ca: Historial d'Operacions - ONCE App
es: Historial de Operaciones - ONCE App
eu: Eragiketen Historiala - ONCE App

# settingsPageTitle
source: Settings - ONCE App
ca: Configuració - ONCE App
es: Configuración - ONCE App
eu: Ezarpenak - ONCE App

# appDescription
source: Accessible web application for ONCE
ca: Aplicació web accessible per a l'ONCE
es: Aplicación web accesible para la ONCE
eu: ONCErentzako web aplikazio eskuragarria

# logoAlt
source: ONCE Logo
ca: Logotip de l'ONCE
es: Logotipo de la ONCE
eu: ONCEren logotipoa

# navCalculator
source: Calculator
ca: Calculadora
es: Calculadora
eu: Kalkulagailua

# navHistory
source: History
ca: Historial
es: Historial
eu: Historiala

# navSettings
source: Settings
ca: Configuració
es: Configuración
eu: Ezarpenak

# calculatorTitle
source: Change Calculator
ca: Calculadora de Canvi
es: Calculadora de Cambio
eu: Aldaketa Kalkulagailua

# totalToPayLabel
source: Total to Pay (€)
ca: Total a Pagar (€)
es: Total a Pagar (€)
eu: Ordaindu beharreko totala (€)

# totalToPayPlaceholder
source: e.g., 5.50
ca: Ex: 5.50
es: Ej: 5.50
eu: Adib: 5.50

# amountReceivedLabel
source: Amount Received (€)
ca: Import Rebut (€)
es: Importe Recibido (€)
eu: Jasotako zenbatekoa (€)

# amountReceivedPlaceholder
source: e.g., 10.00
ca: Ex: 10.00
es: Ej: 10.00
eu: Adib: 10.00

# calculateButton
source: Calculate
ca: Calcular
es: Calcular
eu: Kalkulatu

# voiceInputButtonLabel
source: Use voice input
ca: Utilitzar entrada de veu
es: Usar entrada de voz
eu: Ahots bidezko sarrera erabili

# microphoneIconAlt
source: Microphone icon
ca: Icona de micròfon
es: Icono de micrófono
eu: Mikrofonoaren ikonoa

# loadingText
source: Loading...
ca: Carregant...
es: Cargando...
eu: Kargatzen...

# historyTitle
source: Transaction History
ca: Historial d'Operacions
es: Historial de Operaciones
eu: Eragiketen Historiala

# historyHeaderDate
source: Date and Time
ca: Data i Hora
es: Fecha y Hora
eu: Data eta Ordua

# historyHeaderTotal
source: Total Paid
ca: Total Pagat
es: Total Pagado
eu: Ordaindutako totala

# historyHeaderReceived
source: Amount Received
ca: Import Rebut
es: Importe Recibido
eu: Jasotako zenbatekoa

# historyHeaderChange
source: Change Returned
ca: Canvi Tornat
es: Cambio Devuelto
eu: Itzulitako aldaketa

# settingsTitle
source: Settings
ca: Configuració
es: Configuración
eu: Ezarpenak

# settingsDarkModeLabel
source: Dark Mode
ca: Mode Fosc
es: Modo Oscuro
eu: Modu Iluna

# settingsLanguageLabel
source: Language
ca: Idioma
es: Idioma
eu: Hizkuntza

# settingsLangSpanish
source: Spanish
ca: Espanyol
es: Español
eu: Gaztelania

# settingsLangEnglish
source: English
ca: Anglès
es: Inglés
eu: Ingelesa

# settingsLangGalician
source: Galician
ca: Gallec
es: Gallego
eu: Galiziera

# settingsLangCatalan
source: Catalan
ca: Català
es: Catalán
eu: Katalana

# settingsLangValencian
source: Valencian
ca: Valencià
es: Valenciano
eu: Valentziera

# settingsLangBasque
source: Basque
ca: Basc
es: Euskera
eu: Euskara

# settingsSerialTitle
source: External Device Communication
ca: Comunicació amb Dispositiu Extern
es: Comunicación con Dispositivo Externo
eu: Kanpoko Gailuarekin Komunikazioa

# settingsSerialDescription
source: Connect a device via USB to send and receive data.
ca: Connecta un dispositiu per USB per a enviar i rebre dades.
es: Conecta un dispositivo por USB para enviar y recibir datos.
eu: Konektatu gailu bat USB bidez datuak bidaltzeko eta jasotzeko.

# settingsMachineModelLabel
source: Machine Model
ca: Model de Màquina
es: Modelo de Máquina
eu: Makina Eredua

# settingsMachineModelS
source: Model S (Basic)
ca: Model S (Bàsic)
es: Modelo S (Básico)
eu: S Eredua (Oinarrizkoa)

# settingsMachineModelM
source: Model M (Standard)
ca: Model M (Estàndard)
es: Modelo M (Estándar)
eu: M Eredua (Estandarra)

# settingsMachineModelMax
source: Model MAX (Complete)
ca: Model MAX (Complet)
es: Modelo MAX (Completo)
eu: MAX Eredua (Osoa)

# settingsSerialConnect
source: Connect Device
ca: Connectar Dispositiu
es: Conectar Dispositivo
eu: Gailua Konektatu

# settingsSerialSend
source: Send
ca: Enviar
es: Enviar
eu: Bidali

# settingsSerialPlaceholder
source: Type a command...
ca: Escriu una ordre...
es: Escribe un comando...
eu: Idatzi komando bat...

# settingsSerialConsoleLabel
source: Communication console
ca: Consola de comunicació
es: Consola de comunicación
eu: Komunikazio kontsola

# changeResultText
source: The change to return is: {change} €
ca: El canvi a tornar és: {change} €
es: El cambio a devolver es: {change} €
eu: Itzuli beharreko aldaketa hau da: {change} €

# invalidInputText
source: Please enter valid amounts.
ca: Si us plau, introdueix imports vàlids.
es: Por favor, introduce importes válidos.
eu: Mesedez, sartu zenbateko baliodunak.

# amountReceivedLowText
source: The amount received is less than the total to pay.
ca: L'import rebut és menor que el total a pagar.
es: El importe recibido es menor que el total a pagar.
eu: Jasotako zenbatekoa ordaindu beharrekoa baino txikiagoa da.

# serverCommunicationError
source: Error communicating with the server.
ca: Error en la comunicació amb el servidor.
es: Error en la comunicación con el servidor.
eu: Errorea zerbitzariarekin komunikatzean.

# genericError
source: An error has occurred. Please try again.
ca: S'ha produït un error. Si us plau, intenta-ho de nou.
es: Ha ocurrido un error. Por favor, inténtalo de nuevo.
eu: Errore bat gertatu da. Mesedez, saiatu berriro.

# historyEmpty
source: No operations recorded.
ca: No hi ha operacions registrades.
es: No hay operaciones registradas.
eu: Ez dago eragiketarik erregistratuta.

# historyError
source: Error loading history.
ca: Error en carregar l'historial.
es: Error al cargar el historial.
eu: Errorea historia kargatzean.

# serialNotSupported
source: Error: The Web Serial API is not supported in this browser.
ca: Error: La Web Serial API no és compatible amb aquest navegador.
es: Error: La Web Serial API no es compatible con este navegador.
eu: Errorea: Web Serial APIa ez da bateragarria nabigatzaile honekin.

# serialConfigSent
source: Configuration sent: Model {model}
ca: Configuració enviada: Model {model}
es: Configuración enviada: Modelo {model}
eu: Konfigurazioa bidalita: {model} eredua

# serialConfigError
source: Error sending configuration: {error}
ca: Error en enviar la configuració: {error}
es: Error al enviar configuración: {error}
eu: Errorea konfigurazioa bidaltzean: {error}

# serialConnected
source: Connected to serial port.
ca: Connectat al port sèrie.
es: Conectado al puerto serie.
eu: Serieko portura konektatuta.

# serialDisconnect
source: Disconnect
ca: Desconnectar
es: Desconectar
eu: Deskonektatu

# serialConnectError
source: Error connecting: {error}
ca: Error en connectar: {error}
es: Error al conectar: {error}
eu: Errorea konektatzean: {error}

# serialDisconnected
source: Disconnected from serial port.
ca: Desconnectat del port sèrie.
es: Desconectado del puerto serie.
eu: Serieko portutik deskonektatuta.

# serialDisconnectError
source: Error disconnecting: {error}
ca: Error en desconnectar: {error}
es: Error al desconectar: {error}
eu: Errorea deskonektatzean: {error}

# serialReceived
source: Received: {value}
ca: Rebut: {value}
es: Recibido: {value}
eu: Jasota: {value}

# serialReadError
source: Read error: {error}
ca: Error de lectura: {error}
es: Error de lectura: {error}
eu: Irakurketa errorea: {error}

# serialSent
source: Sent: {data}
ca: Enviat: {data}
es: Enviado: {data}
eu: Bidalita: {data}

# serialSendError
source: Error sending: {error}
ca: Error en enviar: {error}
es: Error al enviar: {error}
eu: Errorea bidaltzean: {error}

# speechRecognitionNotAvailable
source: Voice recognition not available.
ca: Reconeixement de veu no disponible.
es: Reconocimiento de voz no disponible.
eu: Ahotsaren ezagutza ez dago erabilgarri.

# speechRecognitionInitError
source: Could not initialize voice recognition.
ca: No s'ha pogut inicialitzar el reconeixement.
es: No se pudo inicializar el reconocimiento.
eu: Ezin izan da ahotsaren ezagutza hasi.

# speechProcessing
source: Processing...
ca: Processant...
es: Procesando...
eu: Prozesatzen...

# speechRecognized
source: Values recognized
ca: Valors reconeguts
es: Valores reconocidos
eu: Balioak ezagututa

# speechNotInterpreted
source: Could not interpret.
ca: No s'ha pogut interpretar.
es: No se pudo interpretar.
eu: Ezin izan da interpretatu.

# speechError
source: Recognition error: {error}
ca: Error de reconeixement: {error}
es: Error de reconocimiento: {error}
eu: Aintzatespen errorea: {error}

# speechStartError
source: Error starting recognition.
ca: Error en iniciar el reconeixement.
es: Error al iniciar reconocimiento.
eu: Errorea aintzatespena hastean.

# speechChangeToReturn
source: The change to return is:
ca: El canvi a tornar és:
es: El cambio a devolver es:
eu: Itzuli beharreko aldaketa hau da:

# speechCentSingular
source: cent
ca: cèntim
es: céntimo
eu: zentimo

# speechCentPlural
source: cents
ca: cèntims
es: céntimos
eu: zentimo

# speechWith
source: with
ca: amb
es: con
eu: eta

# speechZero
source: zero
es: cero

# speechOneEuro
source: one euro
ca: un euro
es: un euro
eu: euro bat

# speechOneCent
source: one cent
ca: un cèntim
es: un céntimo
eu: zentimo bat

source: Missing required fields
ca: Falten camps obligatoris
es: Faltan campos obligatorios
eu: Beharrezko eremuak falta dira

source: Invalid number format
ca: Format de número no vàlid
es: Formato de número no válido
eu: Zenbaki formatu okerra

# smallWords
source: zero:0,one:1,two:2,three:3,four:4,five:5,six:6,seven:7,eight:8,nine:9,ten:10,eleven:11,twelve:12,thirteen:13,fourteen:14,fifteen:15,sixteen:16,seventeen:17,eighteen:18,nineteen:19,twenty:20,thirty:30,forty:40,fifty:50,sixty:60,seventy:70,eighty:80,ninety:90,hundred:100,thousand:1000
ca: zero:0,un:1,dos:2,tres:3,quatre:4,cinc:5,sis:6,set:7,vuit:8,nou:9,deu:10,onze:11,dotze:12,tretze:13,catorze:14,quinze:15,setze:16,disset:17,divuit:18,dinou:19,vint:20,trenta:30,quaranta:40,cinquanta:50,seixanta:60,setanta:70,vuitanta:80,noranta:90,cent:100,mil:1000
es: cero:0,uno:1,dos:2,tres:3,cuatro:4,cinco:5,seis:6,siete:7,ocho:8,nueve:9,diez:10,once:11,doce:12,trece:13,catorce:14,quince:15,dieciseis:16,dieciséis:16,diecisiete:17,dieciocho:18,diecinueve:19,veinte:20,veintiuno:21,veintidos:22,veintidós:22,treinta:30,cuarenta:40,cincuenta:50,sesenta:60,setenta:70,ochenta:80,noventa:90,cien:100,ciento:100,doscientos:200,trescientos:300,cuatrocientos:400,quinientos:500,seiscientos:600,setecientos:700,ochocientos:800,novecientos:900,mil:1000
eu: zero:0,bat:1,bi:2,hiru:3,lau:4,bost:5,sei:6,zazpi:7,zortzi:8,bederatzi:9,hamar:10,hamaika:11,hamabi:12,hamahiru:13,hamalau:14,hamabost:15,hamasei:16,hamazazpi:17,hemezortzi:18,hemeretzi:19,hogei:20,hogeita:20,hogeita hamar:30,berrogei:40,berrogeita hamar:50,hirurogei:60,hirurogeita hamar:70,laurogei:80,laurogeita hamar:90,ehun:100,mila:1000

# speechKeywords
source: pays with,gives me,I give,received,I hand over,they pay
ca: paga amb,em dóna,dono,rebut,entrego,paguen
es: paga con,me da,le doy,recibido,entrego,pagan
eu: ordaintzen du,ematen dit,ematean,jasota,entregatzen dut,ordaintzen dute

# speechEuroPlural
source: euros
eu: euro
